tap "bramstein/webfonttools"
tap "mike-engel/jwt-cli"
tap "buo/cask-upgrade"
tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/cask-fonts"

brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "bash"
brew "bash-completion2"
brew "wget"
brew "vim"
brew "neovim"
brew "woff2"
brew "binutils"
brew "the_platinum_searcher"
brew "ripgrep"
brew "dark-mode"
brew "lua"
brew "lynx"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "ssh-copy-id"
brew "testssl"
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "grc"
brew "curl"
brew "ctags"
brew "screen"
brew "tmux"
brew "tree"
brew "htop"
brew "fasd"
brew "mc"
brew "httpie"
brew "psgrep"
brew "jq"
brew "stow"
brew "pandoc"
brew "elixir"
brew "reattach-to-user-namespace"
brew "gnupg"
brew "pwgen"
brew "pass"
brew "kubectx"
brew "docker", link: false
brew "git"
brew "git-extras"
brew "git-delta"
brew "gnu-getopt"
brew "python@3.10"
brew "imagemagick"
brew "node"
brew "nvm"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "pure"
brew "diff-so-fancy"

brew "sfnt2woff"
brew "sfnt2woff-zopfli"

cask "alfred"
cask "bartender"
cask "appcleaner"
cask "hammerspoon"
cask "docker"
cask "google-chrome"
cask "google-drive"
cask "microsoft-teams"
cask "istat-menus"
cask "iterm2"
cask "sourcetree"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "firefox"
cask "vlc"
cask "karabiner-elements"
cask "postman"
cask "signal"
cask "miro"
cask "bitwarden"

#####
# Fonts
#####

cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-iosevka-nerd-font'