tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "bramstein/webfonttools"
tap "mike-engel/jwt-cli"
tap "buo/cask-upgrade"
tap "denisidoro/tools"

brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "bash"
brew "bash-completion@2"
brew "vim"
brew "neovim"
brew "woff2"
brew "binutils"
brew "ripgrep"
brew "fd"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "ssh-copy-id"
brew "testssl"
brew "vbindiff"
brew "zopfli"
brew "grc"
brew "curl"
brew "wget"
brew "ctags"
brew "screen"
brew "tmux"
brew "tree"
brew "htop"
# brew "fasd"
brew "mc"
brew "httpie"
brew "psgrep"
brew "jq"
brew "pandoc"
brew "elixir"
brew "reattach-to-user-namespace"
brew "gnupg"
brew "pwgen"
brew "pass"
brew "kubectx"
brew "docker"
brew "docker-compose"
brew "git"
brew "git-extras"
brew "git-delta"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnutls"
brew "imagemagick"
brew "node"
# brew "nvm"
brew "pure"
brew "diff-so-fancy"
brew "fzf"
brew "bat"
brew "yq"
brew "exo"
brew "colima"
brew "jesseduffield/lazygit/lazygit"
brew "zoxide"
brew "asdf"
brew "awscli"
brew "midnight-commander"
brew "nmap"
brew "nnn"
brew "p7zip"
brew "pipx"
brew "pyenv"
brew "pwgen"
brew "fish"

cask "raycast"
cask "appcleaner"
cask "bitwarden"
cask "drawio"
cask "hammerspoon"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "microsoft-teams"
cask "istat-menus"
cask "iterm2"
cask "wezterm"
cask "sourcetree"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "karabiner-elements"
cask "postman"
cask "signal"
cask "miro"
cask "mark-text"
cask "stats"
cask "dash"

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-iosevka-nerd-font"
cask "font-menlo-for-powerline"




